Repository: Light-Heads/GoogleHack4Change
Catalog: lib/l10n/app_*.arb
Languages: te

# language
source: English
te: Telugu

# hello
source: Hello {username}
te: హలో {username}

source: Logout
te: లాగ్ అవుట్

source: Profile
te: ప్రొఫైల్

source: Add Work
te: పని జోడించండి

source: Farmer
te: రైతు

source: Welcome
te: స్వాగతం

# current
source: Current Conditions
te: వ్యవసాయ పరిస్థితులు

# missed
source: You have been missed!
te: మీరు మిస్ అయ్యారు!

# explore
source: Login to explore options
te: అన్వేషించడానికి లాగిన్ చేయండి

# buttonLogin
source: Login with Google
te: Google తో లాగిన్ చేయండి

source: View More
te: మరిన్ని చూడండి

# directSatellite
source: This data directly comes from satellite
te: ఈ డేటా నేరుగా ఉపగ్రహం నుండి వస్తుంది

source: View Suggestions
te: సూచనలను చూడండి

source: Suggestions
te: సూచనలు

source: Your Farm Data
te: మీ వ్యవసాయ డేటా

# basedSatellite
source: Based on satellite data
te: ఉపగ్రహ డేటా ఆధారంగా

source: Insights
te: అంతర్దృష్టులు

# health
source: Crop Health
te: పంట ఆరోగ్యం

source: Water Stress
te: నీటి ఒత్తిడి

source: Nitrogen
te: నత్రజని స్థాయిలు

source: Maturity
te: పంట పరిపాలన

source: Low
te: తక్కువ

source: Medium
te: మధ్యస్థం

source: High
te: అధిక

source: Good
te: మంచి

# nitGood
source: Nitrogen levels are Good
te: నత్రజని స్థాయిలు బాగున్నాయి

# nitAdequate
source: Nitrogen levels are adequate for current crop conditions.
te: ప్రస్తుత పంట పరిస్థితులకు నత్రజని స్థాయిలు సరిపోతాయి

# nitLow
source: Nitrogen levels are low. Consider applying nitrogen-rich fertilizers.
te: నత్రజని స్థాయిలు తక్కువగా ఉంటాయి. నత్రజని అధికంగా ఉండే ఎరువులను వర్తింపజేయడాన్ని పరిగణించండి

# vegHealthGood
source: Vegetation Health is Good
te: పంట ఆరోగ్యం మంచిగా ఉంది

# vegHealthImprove
source: Vegetation health needs improvement. Consider nutrient management.
te: పంట ఆరోగ్యం మెరుగుపడాలి. పోషకాల నిర్వహణను పరిగణించండి

source: Actions
te: చర్యలు

source: Water Limit
te: నీటి తాగితో అనుమానాన్ని అంగీకరించబడింది.

source: Moderate Water
te: మాద్యమమైన నీటి తాగాన్ని అంగీకరించబడింది. సించాయిట్ సరిచేయడానికి ఆలోచించండి

source: Featured
te: లక్షణాలు

# addField
source: Add FarmField
te: కొత్త పొలం

# detect
source: Detect Disease
te: వ్యాధిని గుర్తించడం

# mandiPrice
source: Mandi Prices
te: మండి ధరలు

source: Weather
te: వాతావరణం

source: Market
te: సంత

source: Chat
te: చాట్

source: Settings
te: సెట్టింగ్స్
